In [48]:
import numpy as np 
import pandas as pd

In [49]:
s1 = pd.Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [50]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [51]:
s1.values

array([1, 2, 3, 4])

In [52]:
s2 = pd.Series([1,2,3,4], index=list("abcd"))
s2

a    1
b    2
c    3
d    4
dtype: int64

In [53]:
s2[0]

C:\Users\Admin\AppData\Local\Temp\ipykernel_17428\2344841457.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[0]

np.int64(1)

In [54]:
s2['a']

np.int64(1)

In [55]:
df1 = pd.DataFrame({'name':['Long','Mai'],
                    'Scores':[9,7]})
df1

   name  Scores
0  Long       9
1   Mai       7

In [56]:
type(df1)

pandas.core.frame.DataFrame

In [57]:
type(s1)

pandas.core.series.Series

In [58]:
df2 = pd.DataFrame(data=np.arange(1,7).reshape(2,3), 
                   index=['row1','row2'],
                   columns=['col1','col2','col3'])
df2

      col1  col2  col3
row1     1     2     3
row2     4     5     6

In [59]:
df2['col1']

row1    1
row2    4
Name: col1, dtype: int64

In [60]:
df2[['col1','col3']]

      col1  col3
row1     1     3
row2     4     6

In [61]:
df2['col1']

row1    1
row2    4
Name: col1, dtype: int64

In [62]:
df2

      col1  col2  col3
row1     1     2     3
row2     4     5     6

In [63]:
df2.iloc[0]

col1    1
col2    2
col3    3
Name: row1, dtype: int64

In [64]:
df2.loc['row2']

col1    4
col2    5
col3    6
Name: row2, dtype: int64

In [65]:
df_rt = pd.read_excel(r'Data\Online_Retail.xlsx')
df_rt.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [66]:
df_rt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [67]:
df_rt['InvoiceNo'].value_counts()

InvoiceNo
573585     1114
581219      749
581492      731
580729      721
558475      705
           ...
581483        1
581566        1
C581499       1
C536383       1
C536379       1
Name: count, Length: 25900, dtype: int64

In [68]:
df_rt.shape

(541909, 8)

In [69]:
df_rt.describe()

,Quantity,InvoiceDate,UnitPrice,CustomerID
count,541909.000000,541909,541909.000000,406829.000000
mean,9.552250,2011-07-04 13:34:57.156386048,4.611114,15287.690570
min,-80995.000000,2010-12-01 08:26:00,-11062.060000,12346.000000
25%,1.000000,2011-03-28 11:34:00,1.250000,13953.000000
50%,3.000000,2011-07-19 17:17:00,2.080000,15152.000000
75%,10.000000,2011-10-19 11:27:00,4.130000,16791.000000
max,80995.000000,2011-12-09 12:50:00,38970.000000,18287.000000
std,218.081158,NaN,96.759853,1713.600303

In [70]:
data = {'Tên': ['An', 'Bình', 'Chi', 'Dũng'],
         'Tuổi': [28, 34, 29, 42],
         'Thành phố': ['Hà Nội', 'TP.HCM', 'Đà Nẵng', 'Hà Nội']}
df_sample = pd.DataFrame(data)
df_sample

    Tên  Tuổi Thành phố
0    An    28    Hà Nội
1  Bình    34    TP.HCM
2   Chi    29   Đà Nẵng
3  Dũng    42    Hà Nội

In [71]:
df_sample['Tên']

0      An
1    Bình
2     Chi
3    Dũng
Name: Tên, dtype: object

In [72]:
df_sample[['Tên','Thành phố']]

    Tên Thành phố
0    An    Hà Nội
1  Bình    TP.HCM
2   Chi   Đà Nẵng
3  Dũng    Hà Nội

In [73]:
df_sample

    Tên  Tuổi Thành phố
0    An    28    Hà Nội
1  Bình    34    TP.HCM
2   Chi    29   Đà Nẵng
3  Dũng    42    Hà Nội

In [74]:
df_sample[df_sample['Tuổi']>30]

    Tên  Tuổi Thành phố
1  Bình    34    TP.HCM
3  Dũng    42    Hà Nội

In [75]:
data_missing = {'Sản phẩm': ['A', 'B', 'C', 'D'],
                 'Giá': [100, 200, np.nan, 400],
                 'Tồn kho': [10, np.nan, 30, 50]}
df_missing = pd.DataFrame(data_missing)
df_missing

  Sản phẩm    Giá  Tồn kho
0        A  100.0     10.0
1        B  200.0      NaN
2        C    NaN     30.0
3        D  400.0     50.0

In [76]:
df_missing.isna()

   Sản phẩm    Giá  Tồn kho
0     False  False    False
1     False  False     True
2     False   True    False
3     False  False    False

In [77]:
df_missing.isnull().sum()

Sản phẩm    0
Giá         1
Tồn kho     1
dtype: int64

In [78]:
df_missing['Giá']

0    100.0
1    200.0
2      NaN
3    400.0
Name: Giá, dtype: float64

In [79]:
gia_mean = df_missing['Giá'].mean()
df_missing['Giá'].fillna(gia_mean)

0    100.000000
1    200.000000
2    233.333333
3    400.000000
Name: Giá, dtype: float64

In [80]:
df_missing

  Sản phẩm    Giá  Tồn kho
0        A  100.0     10.0
1        B  200.0      NaN
2        C    NaN     30.0
3        D  400.0     50.0

In [81]:
df_missing.dropna()

  Sản phẩm    Giá  Tồn kho
0        A  100.0     10.0
3        D  400.0     50.0

In [82]:
df_missing.dropna(subset='Giá') # thường dùng hơn, tập trung vào đối tượng cần phân tích

  Sản phẩm    Giá  Tồn kho
0        A  100.0     10.0
1        B  200.0      NaN
3        D  400.0     50.0

In [83]:
data_types = {'Mã KH': [101, 102, 103],
               'Doanh thu': ['5,000', '12,000', '7,500']}
df_types = pd.DataFrame(data_types)
df_types

   Mã KH Doanh thu
0    101     5,000
1    102    12,000
2    103     7,500

In [84]:
df_types.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Mã KH      3 non-null      int64
 1   Doanh thu  3 non-null      object
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [85]:
df_types['Mã KH'] = df_types['Mã KH'].astype(str)
df_types.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Mã KH      3 non-null      object
 1   Doanh thu  3 non-null      object
dtypes: object(2)
memory usage: 180.0+ bytes

In [86]:
df_types['Doanh thu'] = df_types['Doanh thu'].str.replace(',','').astype(float)
df_types

  Mã KH  Doanh thu
0   101     5000.0
1   102    12000.0
2   103     7500.0

In [87]:
df_sample

    Tên  Tuổi Thành phố
0    An    28    Hà Nội
1  Bình    34    TP.HCM
2   Chi    29   Đà Nẵng
3  Dũng    42    Hà Nội

In [88]:
df_sample['Thành phố'].value_counts()

Thành phố
Hà Nội     2
TP.HCM     1
Đà Nẵng    1
Name: count, dtype: int64

In [89]:
df = pd.DataFrame({'key': list("ABCABC"),
                   "data":range(6)},
                   columns=['key','data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [90]:
df['key'].value_counts()

key
A    2
B    2
C    2
Name: count, dtype: int64

In [91]:
list(df.groupby('key'))

[('A',
    key  data
  0   A     0
  3   A     3),
 ('B',
    key  data
  1   B     1
  4   B     4),
 ('C',
    key  data
  2   C     2
  5   C     5)]

In [92]:
data_group = {'Phòng ban': ['Sale', 'IT', 'Sale', 'IT', 'HR'],
               'Lương': [500, 700, 600, 800, 400]}
df_group = pd.DataFrame(data_group)
df_group

  Phòng ban  Lương
0      Sale    500
1        IT    700
2      Sale    600
3        IT    800
4        HR    400

In [93]:
df_group.groupby('Phòng ban').sum()

           Lương
Phòng ban
HR           400
IT          1500
Sale        1100

In [94]:
df_group.groupby('Phòng ban').aggregate(['sum','min',lambda x: x.mean()])

          Lương
            sum  min <lambda_0>
Phòng ban
HR          400  400      400.0
IT         1500  700      750.0
Sale       1100  500      550.0

In [95]:
df = pd.DataFrame({'key': list("ABCABC"),
                   "data":range(6)},
                   columns=['key','data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [ ]:
list(df.groupby('key'))#split

[('A',
    key  data
  0   A     0
  3   A     3),
 ('B',
    key  data
  1   B     1
  4   B     4),
 ('C',
    key  data
  2   C     2
  5   C     5)]

In [97]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [99]:
df.groupby('key').agg(['mean','sum',lambda x: x.sum()/2])

    data
    mean sum <lambda_0>
key
A    1.5   3        1.5
B    2.5   5        2.5
C    3.5   7        3.5

In [100]:
df_rt.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [101]:
df_rt['revenue'] = df_rt['UnitPrice']*df_rt['Quantity']

In [105]:
df_rt[["CustomerID",'revenue']].groupby("CustomerID").sum().sort_values(by='revenue',ascending=False)

              revenue
CustomerID
14646.0     279489.02
18102.0     256438.49
17450.0     187482.17
14911.0     132572.62
12415.0     123725.45
...               ...
12503.0      -1126.00
17603.0      -1165.30
14213.0      -1192.20
15369.0      -1592.49
17448.0      -4287.63

[4372 rows x 1 columns]

In [106]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [110]:
titanic.groupby(['sex','class'])['survived'].mean().unstack()

C:\Users\Admin\AppData\Local\Temp\ipykernel_17428\2728885616.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(['sex','class'])['survived'].mean().unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [112]:
titanic.pivot_table(index='sex', 
                    columns='class',
                    values='survived',
                    aggfunc='mean',
                    margins=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_17428\582205776.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table(index='sex',

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [114]:
# Dữ liệu bán hàng tháng 1
df1 = pd.DataFrame({
     'Sản phẩm': ['A', 'B'],
     'Số lượng': [10, 15]
})
# Dữ liệu bán hàng tháng 2
df2 = pd.DataFrame({
     'Sản phẩm': ['A', 'C'],
    'Số lượng': [8, 5]})
print(df1,'\n', df2)

  Sản phẩm  Số lượng
0        A        10
1        B        15
   Sản phẩm  Số lượng
0        A         8
1        C         5

In [115]:
pd.concat([df1,df2],axis = 0)

  Sản phẩm  Số lượng
0        A        10
1        B        15
0        A         8
1        C         5

In [116]:
pd.concat([df1,df2],axis = 1)

  Sản phẩm  Số lượng Sản phẩm  Số lượng
0        A        10        A         8
1        B        15        C         5

In [118]:
df3 = pd.DataFrame({
     'Sp': ['A', 'C','D'],
    'Số lượng': [8, 5,6]})
df3

  Sp  Số lượng
0  A         8
1  C         5
2  D         6

In [121]:
pd.concat([df1,df3],axis = 0, join='inner')

   Số lượng
0        10
1        15
0         8
1         5
2         6

In [122]:
df_info = pd.DataFrame({'employee_id': ['1', '2', '3'], 'name': ['An', 'Bình', 'Chi']})
df_salary = pd.DataFrame({'employee_id': ['2', '1', '4'], 'salary': [600, 800, 700]})

In [123]:
df_info

  employee_id  name
0           1    An
1           2  Bình
2           3   Chi

In [124]:
df_salary

  employee_id  salary
0           2     600
1           1     800
2           4     700

In [127]:
pd.merge(df_info,df_salary, how='left')

  employee_id  name  salary
0           1    An   800.0
1           2  Bình   600.0
2           3   Chi     NaN

In [128]:
df_rt.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,revenue
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34

In [130]:
df_rt.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
revenue             0
dtype: int64

In [131]:
df_clean = df_rt.dropna(subset=['CustomerID'])
df_clean.isnull().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
revenue        0
dtype: int64

In [132]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 406829 entries, 0 to 541908
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    406829 non-null  object
 1   StockCode    406829 non-null  object
 2   Description  406829 non-null  object
 3   Quantity     406829 non-null  int64
 4   InvoiceDate  406829 non-null  datetime64[ns]
 5   UnitPrice    406829 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      406829 non-null  object
 8   revenue      406829 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(4)
memory usage: 31.0+ MB

In [134]:
df_clean.rename(columns={'revenue':'TotalPrice'}, inplace=True)
df_clean.head()

C:\Users\Admin\AppData\Local\Temp\ipykernel_17428\1630185956.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_clean.rename(columns={'revenue':'TotalPrice'}, inplace=True)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34

In [135]:
df_clean['CustomerID'] = df_clean['CustomerID'].astype(int).astype(str)
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 406829 entries, 0 to 541908
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    406829 non-null  object
 1   StockCode    406829 non-null  object
 2   Description  406829 non-null  object
 3   Quantity     406829 non-null  int64
 4   InvoiceDate  406829 non-null  datetime64[ns]
 5   UnitPrice    406829 non-null  float64
 6   CustomerID   406829 non-null  object
 7   Country      406829 non-null  object
 8   TotalPrice   406829 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(5)
memory usage: 31.0+ MB

C:\Users\Admin\AppData\Local\Temp\ipykernel_17428\3983432004.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_clean['CustomerID'] = df_clean['CustomerID'].astype(int).astype(str)

In [136]:
df_clean.describe()

,Quantity,InvoiceDate,UnitPrice,TotalPrice
count,406829.000000,406829,406829.000000,406829.000000
mean,12.061303,2011-07-10 16:30:57.879207424,3.460471,20.401854
min,-80995.000000,2010-12-01 08:26:00,0.000000,-168469.600000
25%,2.000000,2011-04-06 15:02:00,1.250000,4.200000
50%,5.000000,2011-07-31 11:48:00,1.950000,11.100000
75%,12.000000,2011-10-20 13:06:00,3.750000,19.500000
max,80995.000000,2011-12-09 12:50:00,38970.000000,168469.600000
std,248.693370,NaN,69.315162,427.591718

In [137]:
df_clean[df_clean['Quantity']<0].head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalPrice
141,C536379,D,Discount,-1,2010-12-01 09:41:00,27.50,14527,United Kingdom,-27.50
154,C536383,35004C,SET OF 3 COLOURED FLYING DUCKS,-1,2010-12-01 09:49:00,4.65,15311,United Kingdom,-4.65
235,C536391,22556,PLASTERS IN TIN CIRCUS PARADE,-12,2010-12-01 10:24:00,1.65,17548,United Kingdom,-19.80
236,C536391,21984,PACK OF 12 PINK PAISLEY TISSUES,-24,2010-12-01 10:24:00,0.29,17548,United Kingdom,-6.96
237,C536391,21983,PACK OF 12 BLUE PAISLEY TISSUES,-24,2010-12-01 10:24:00,0.29,17548,United Kingdom,-6.96

In [138]:
df_clean = df_clean[df_clean['Quantity']>0]
df_clean.describe()

,Quantity,InvoiceDate,UnitPrice,TotalPrice
count,397924.000000,397924,397924.000000,397924.000000
mean,13.021823,2011-07-10 23:43:36.912475648,3.116174,22.394749
min,1.000000,2010-12-01 08:26:00,0.000000,0.000000
25%,2.000000,2011-04-07 11:12:00,1.250000,4.680000
50%,6.000000,2011-07-31 14:39:00,1.950000,11.800000
75%,12.000000,2011-10-20 14:33:00,3.750000,19.800000
max,80995.000000,2011-12-09 12:50:00,8142.750000,168469.600000
std,180.420210,NaN,22.096788,309.055588

In [140]:
df_clean.duplicated().sum()

np.int64(5192)

In [141]:
df_clean.drop_duplicates(inplace=True)
df_clean.duplicated().sum()

np.int64(0)

In [142]:
df_clean.to_csv('Data\OnlineRetail_clean.csv')

In [143]:
#remove outlier by IQR = Q3-Q1, lower= Q1-1.5*IQR, upper = Q3-1.5*IQR

In [145]:
df_clean['Quantity'].quantile(0.75)

np.float64(12.0)